#Задачи на циклы и оператор условия------
#----------------------------------------

###################################################################################################
print('Задача 1')
print('Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.')

for i in range(1, 6):
    print(i, 0, sep = ': ')
print()

###################################################################################################
print('Задача 2')
print('Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.')

c = 0
for i in range(1, 11):
    print('Введите цифру номер ', i, ': ', sep='', end='')
    s = input()
    while  len(s) != 1 or not s.isdigit():
        print('"', s, '"' ' не цифра', sep = '')
        print('Введите цифру номер ', i, ': ', sep = '', end = '')
        s = input()
    d = int(s)
    if d == 5:
        c += 1
print('Чисел 5 найдено:', c)
print()

###################################################################################################
print('Задача 3')
print('Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.')

sum = 0
for i in range(1, 101):
    sum += i
print('Сумма ряда чисел от 1 до 100:',  sum)
print()

####################################################################################################
print('Задача 4')
print('Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.')

mul = 1
for i in range(1, 11):
    mul *= i
print('Произведение ряда чисел от 1 до 10:', mul)
print()

####################################################################################################
print('Задача 5')
print('Вывести цифры числа на каждой строчке.')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

p = 10 # найдем порядок числа
while p < integer_number: # пока не превысим введенное число сравнивая его
    p *= 10  # последовательно с 10, 100, 1000, и тд

while integer_number > 0:
    p //= 10
    print(integer_number // p)
    integer_number %= p
print()

####################################################################################################
print('Задача 6')
print('Найти сумму цифр числа.')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

c = 0
while integer_number > 0:
    c += integer_number % 10
    integer_number //= 10
print('Сумма цифр:', c)
print()

####################################################################################################
print('Задача 7')
print('Найти произведение цифр числа.')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

c = 1
while integer_number > 0:
    c *= integer_number % 10
    integer_number //= 10
print('Произведение цифр:', c)
print()

####################################################################################################
print('Задача 8')
print('Дать ответ на вопрос: есть ли среди цифр числа 5?')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

while integer_number > 0:
    if integer_number % 10 == 5:
        print('Цифра 5 найдена')
        break
    integer_number //= 10
else:
    print('Цифра 5 не найдена')
print()

####################################################################################################
print('Задача 9')
print('Найти максимальную цифру в числе')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

m = 0
while integer_number > 0:
    if m < integer_number % 10:
        m = integer_number % 10
    integer_number //= 10
print('Максимальная цифра:', m)
print()

####################################################################################################
print('Задача 10')
print('Найти количество цифр 5 в числе')

s = input('Введите натуральное число: ')
while not s.isdigit():
    print('"', s, '"' ' не натуральное число', sep = '')
    s = input('Введите натуральное число: ')
integer_number = int(s)

c = 0
while integer_number > 0:
    if integer_number % 10 == 5:
        c += 1
    integer_number //= 10
print('Цифр 5 в числе:', c)
